/**
 * Created by hqer on 2017/3/8.
 */
import React from 'react'
class agreement extends React.Component{
    render() {
        return (
            <div className="devDoc">
                <div className="MainTitle">
                    <h1>二级网络能力开放平台服务协议</h1>
                </div>
                <div className="whiteSpace">
                    <div className="textLine">
                        为使用二级网络能力开放平台服务，您应当阅读并遵守《二级网络能力开放平台服务协议》在接受本协议之前，请您仔细阅读、充分理解本协议的所有内容。
                    </div>
                    <div className="title">一、概述</div>
                    <div className="textLine">
                        1、二级网络能力开放平台：是指由中国移动杭州研发中心（下简称中移杭研）提供的，面向开发者提供通信能力API产品的开放平台。开发者可利用平台购买和使用API，完成对互联网产品的开发和完善。
                    </div>
                    <div className="textLine">
                        2、中移杭研有权根据需要修改、更新本协议和各类规则，且毋需另行通知。其一旦发生变动，中移杭研会在二级网络能力开放平台以平台站内信或平台公告方式通知修改后的协议或规则，您在使用相关能力服务时,应关注并遵守其所适用的相关条款。
                    </div>
                    <div className="title">二、注册须知</div>
                    <div className="textLine">
                        1、您通过注册流程注册成为二级网络能力开放平台开发者用户后，即表示您与平台已达成协议，同意接受本协议的所有内容，并受其约束。
                    </div>
                    <div className="textLine">
                        2、您在二级网络能力开放平台注册时，应提供真实、有效的联系方式，包括邮箱和手机号码。您的相关注册信息发生变化时，应当在变更后10个工作日内修改相关注册信息。由于您提交虚假注册信息、提交信息不准确或未及时更新，平台有权停止您服务，导致的任何损失或责任由您自行承担。
                    </div>
                    <div className="textLine">
                        3、您应对自行存放在二级网络能力开放平台上的数据及进入和管理平台各类产品与服务的用户名和密码妥善保管，不得转让、转借其他第三人使用；如因您维护不当或保管不当致使前述数据、用户名或密码等丢失或泄漏所引起的任何损失及后果由您自行承担。
                    </div>
                    <div className="textLine">
                        4、您了解并同意，如您注册账号后连续超过12个月未登录，中移杭研以二级网络能力开放平台优化管理为目的有权回收该账号，相关问题及责任均由您自行承担。
                    </div>
                    <div className="textLine">
                        5、中移杭研根据本协议收回或取消账号后，有权自行对账号相关内容及信息以包括但不限于删除等方式进行处理，且无需就此向开发者用户承担任何责任。
                    </div>
                    <div className="textLine">
                        6、当您使用二级网络能力开放平台提供的某个API时，您的使用行为视为其对本协议条款的同意。
                    </div>
                    <div className="title">三、使用规则</div>
                    <div className="textLine">
                        1、您在使用二级网络能力开放平台提供的API时，必须遵守中华人民共和国相关法律 的规定，您承诺将不会利用本服务进行任何违法或不正当的活动。包括但不限于：
                        <div className="textLevel2">
                            a)反对宪法所确定的基本原则的；<br/>
                            b)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>
                            c)损害国家荣誉和利益的；<br/>
                            d)煽动民族仇恨、民族歧视，破坏民族团结的；<br/>
                            e)破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>
                            f)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>
                            g)侮辱或者诽谤他人，侵害他人合法权益的；<br/>
                            h)含有法律、行政法规禁止的其他内容的。
                        </div>
                    </div>
                    <div className="textLine">
                        2、在进行开发者信息认证时，您需要提供真实、准确、即时、完整的信息，包括但不限于个人姓名、所属地区、证件类型、证件号码、证件照片。公司、政府机关或事业单位需要提交公司/机构名称、营业执照或组织机构代码证（三证合一的请提供统一社会信用代码）、所属地区、详细地址、所属行业、规模、管理员信息等；如前述您的信息发生变更，您应自行在线更新并及时通知二级网络能力开放平台；如因您的信息不真实、不准确、不完整或联系人和/或管理人的行为或不作为而引起的任何后果由您自行承担，中移杭研有权暂停或终止您的账号。
                    </div>
                    <div className="textLine">
                        3、您不得在未经中移杭研许可的情况下，将账号转交给它人或其它公司使用；不得公开二级网络能力开放平台提供给您的API调用参数信息。
                    </div>
                    <div className="textLine">
                        4、您负责您软件的创作、开发、编辑、加工、修改、测试、运营及维护，并且自行承担相应的成本，二级网络能力开放平台不对应用的任何效果作出承诺。
                    </div>
                    <div className="textLine">
                        5、您不得以任何方式或企图干扰二级网络能力开放平台及中移杭研的任何部分、功能的正常运行。如违反上述条款，中移杭研有权根据情节，对您进行警告、限制服务、中止或终止服务等处罚。
                    </div>
                    <div className="title">四、服务与收费</div>
                    <div className="textLine">
                        1、注册后，您可试用二级网络能力开放平台提供的API产品。在您的账号通过信息认证后，方可正式使用和购买由二级网络能力开放平台提供的能力服务。
                    </div>
                    <div className="textLine">
                        2、二级网络能力开放平台实行用户分级制度，将用户分为一到五星五个等级。不同等级用户能够购买的API产品个数上限不同，购买时的价格折扣也有所不同。等级越高，可购买的API个数上限越多，折扣力度也越大。
                    </div>
                    <div className="textLine">
                        3、二级网络能力开放平台以API接口的形式提供能力给您调用，您根据自己的业务需要选择需要的能力，开通并购买能力后，您可以使用二级网络能力开放平台提供的开放能力接口进行应用开发。
                    </div>
                    <div className="textLine">
                        4、中移杭研有权根据经营需要随时变更费用标准，您在进行购买时需谨慎核对。
                    </div>
                    <div className="textLine">
                        5、二级网络能力开放平台规定由购买或充值行为产生的消费金额，一旦支付成功，概不退款。
                    </div>
                    <div className="title">五、知识产权</div>
                    <div className="textLine">
                        1、二级网络能力开放平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由中移杭研或其他权利人依法拥有其知识产权。非经中移杭研或其他权利人书面同意任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容。
                    </div>
                    <div className="textLine">
                        2、未经中移杭研同意，您不得擅自使用二级网络能力开放平台的商标、名称以及中移杭研相关商标及其标识。
                    </div>
                    <div className="textLine">
                        3、开发者独立开发的应用的知识产权归其所有人所有；权利人同意授予二级网络能力开放平台在全球范围内享有免费的、永久性的、不可撤消的、非独家的、可转让、可分许可的许可，许可二级网络能力开放平台使用、调用、演示产品等。该许可不受双方合作终止以及本协议终止的影响。
                    </div>
                    <div className="textLine">
                        4、您不得将二级网络能力开放平台所提供的技术接口、源代码及算法等进行反向工程、反汇编、重构、反编译、翻译、修改、复制，或者在未经明确允许的情况下创作衍生作品。
                    </div>
                    <div className="title">六、隐私条款</div>
                    <div className="textLine">
                        1、您在二级网络能力开放平台登记保留的个人资料将受到保护。中移杭研使用安全技术和程序保护用户的个人、公司、政府机关和事业单位信息不被未经授权的访问、使用或泄露。如发生下列任一情况，中移杭研有权对您的信息予以披露：<br/>
                        <div className="textLevel2">
                            a) 经您同意披露的；<br/>
                            b) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；<br/>
                            c) 如您出现违反中国有关法律、法规、规章、政策的，需要向第三方披露。
                        </div>
                    </div>
                    <div className="textLine">
                        2、您在应用设计上应重视用户体验，尊重用户知情权、选择权，提供应用服务时应坚持诚信原则，不误导、欺诈、混淆用户，尊重用户的隐私，不骚扰用户，不制造垃圾信息。
                    </div>
                    <div className="title">七、免责声明</div>
                    <div className="textLine">
                        1、鉴于网络服务的特殊性，您同意中移杭研会变更、中断部分或全部的网络服务，中移杭研将在二级网络能力开放平台以平台站内信的形式或平台公告方式通知您，中移杭研不承担由此引起的任何责任。
                    </div>
                    <div className="textLine">
                        2、中移杭研有权定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务在合理时间内的中断或暂停，中移杭研无需为此承担任何责任。
                    </div>
                    <div className="textLine">
                        3、如发生下述任一情况而导致服务中断引起损失的，中移杭研不承担责任：<br/>
                        <div className="textLevel2">
                            a）发生不可抗力情形的；<br/>
                            b）黑客攻击、计算机病毒侵入或发作的；<br/>
                            c）计算机系统遭到破坏、瘫痪或无法正常使用的；<br/>
                            d）因政府管制而造成暂时性关闭的；<br/>
                            e）其它非因中移杭研的过错而引起的。
                        </div>
                    </div>
                    <div className="title">八、服务终止</div>
                    <div className="textLine">
                        1、当您违反本协议规定时，中移杭研有权随时暂停或终止向您提供全部二级网络能力开放平台下服务。如您后续再直接或间接或以他人名义注册并登录二级网络能力开放平台的，中移杭研有权直接单方面暂停或终止提供二级网络能力开放平台下的服务。
                    </div>
                    <div className="textLine">
                        2、如本协议服务终止，中移杭研有权保留或删除您账号中的任何信息和全部相关数据，包括服务终止前您尚未完成的任何数据。
                    </div>
                    <div className="textLine">
                        3、因法律法规或政策原因导致二级网络能力开放平台无法继续运营的，双方合同自动解除，互不承担违约责任。
                    </div>
                </div>
            </div>
        )
    }
}
module.exports = agreement;